.emacs.d/Emacs.org
#+title: Emacs Config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :results silent :mkdirp yes

* OS Specific
#+begin_src emacs-lisp
;;; GNU/Linux

(when (eq system-type 'gnu/linux)
  ;; Add GNU/Linux specific stuff here
  )

;;; macOS
(when (eq system-type 'darwin)
  ;; Ensure environment  variables inside Emacs look  the same as in  the user's
  ;; shell.
    (toggle-frame-maximized)
    (setq projectile-enable-caching t))
;;; Windows
(when (eq system-type 'windows-nt)
  ;; Add Windows specific stuff here
    ;; Kudos to Jeffrey Snover: https://docs.microsoft.com/en-us/archive/blogs/dotnetinterop/run-powershell-as-a-shell-within-emacs
    (setq explicit-shell-file-name "powershell.exe")
    (setq explicit-powershell.exe-args '()))

#+end_src

* Run Server
#+begin_src emacs-lisp
(require 'server)
(when (not (server-running-p))
    (server-start))
#+end_src

* Performance
#+begin_src emacs-lisp
(defun mati/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'mati/display-startup-time)

#+end_src

* Backups and autosave
#+begin_src emacs-lisp
;; Put backup files neatly away                                                 
(let ((backup-dir "~/.emacs.d/backups")
      (auto-saves-dir "~/.emacs.d/auto-saves/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir))

(setq backup-by-copying t    ; Don't delink hardlinks                           
      delete-old-versions t  ; Clean up the backups                             
      version-control t      ; Use version numbers on backups,                  
      kept-new-versions 5    ; keep some new versions                           
      kept-old-versions 2)   ; and some old ones, too   
#+end_src

* Package Setup
#+begin_src emacs-lisp
;; Initialize package
(require 'package)
  
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			("melpa-stable" . "https://stable.melpa.org/packages/")
			("org" . "https://orgmode.org/elpa/")
			("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
(package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (or (package-installed-p 'use-package))
    (package-install 'use-package))
(require 'use-package)

;; Uncomment this to get a reading on packages that get loaded at startup
;; (setq use-package-verbose t)

(setq use-package-always-ensure t)

#+end_src

** Straight Config
#+begin_src emacs-lisp
;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
    (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
    (bootstrap-version 5))
(unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	    "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	    'silent 'inhibit-cookies)
    (goto-char (point-max))
    (eval-print-last-sexp)))
(load bootstrap-file nil 'nomessage))


;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)

#+end_src

** Autoupdate
#+begin_src emacs-lisp
(use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "20:00"))

#+end_src

* UX Configuration
#+begin_src emacs-lisp 
;; Thanks, but no thanks
(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)          ; Disable the menu bar

(setq visible-bell t)

(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
		prog-mode-hook
		conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                shell-mode-hook
		treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(fset 'yes-or-no-p 'y-or-n-p)

#+end_src

** OSx ENV
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns x))
  :config
  (setq exec-path-from-shell-variables '("PATH" "GOPATH"))
  (exec-path-from-shell-initialize))

#+end_src

** Themes
#+begin_src emacs-lisp
(pcase system-type
    ((or 'windows-nt 'cygwin)
	(set-face-attribute 'default nil
			:font "JetBrains Mono"
			:weight 'light
			:height 100)))

(use-package doom-themes
    :defer t)

(load-theme 'doom-palenight t)
(doom-themes-visual-bell-config)

(use-package rainbow-delimiters
    :hook (emacs-lisp-mode . rainbow-delimiters-mode))

#+end_src 

** Which Key

#+begin_src emacs-lisp
;; Shotcut suggestions
(use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
	(setq which-key-idle-delay 0.3))

#+end_src

** Ivy and Counsel
#+begin_src emacs-lisp
;; Ivy
(use-package swiper :ensure t)

(use-package ivy
    :diminish
    :bind (:map ivy-minibuffer-map
	    ("TAB" . ivy-alt-done)
	    ("C-f" . ivy-alt-done)
	    ("C-l" . ivy-alt-done)
	    ("C-j" . ivy-next-line)
	    ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	    ("C-k" . ivy-previous-line)
	    ("C-l" . ivy-done)
	    ("C-d" . ivy-switch-buffer-kill)
	:map ivy-reverse-i-search-map
	    ("C-k" . ivy-previous-line)
	    ("C-d" . ivy-reverse-i-search-kill))
    :init
	(ivy-mode 1))

(use-package counsel
    :demand t
    :bind (("M-x" . counsel-M-x)
	("C-x b" . counsel-ibuffer)
	("C-x C-f" . counsel-find-file)
	;; ("C-M-j" . counsel-switch-buffer)
	("C-M-l" . counsel-imenu)
    :map minibuffer-local-map
	("C-r" . 'counsel-minibuffer-history))
    :custom
	(counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
	(setq ivy-initial-inputs-alist nil))


(use-package ivy-rich
    :init
	(ivy-rich-mode 1))

#+end_src

** Better Modeline
#+begin_src emacs-lisp
(use-package diminish
    :ensure t)

(use-package doom-modeline
    :init (doom-modeline-mode 1)) ; run M-x all-the-icons-install-fonts

#+end_src

** Helpful Help Commands
#+begin_src emacs-lisp
(use-package helpful
    :custom
	(counsel-describe-function-function #'helpful-callable)
	(counsel-describe-variable-function #'helpful-variable)
    :bind
	([remap describe-function] . counsel-describe-function)
	([remap describe-symbol] . helpful-symbol)
	([remap describe-variable] . counsel-describe-variable)
	([remap describe-command] . helpful-command)
	([remap describe-key] . helpful-key))

#+end_src

** Treemacs
#+begin_src emacs-lisp
(use-package treemacs)
#+end_src

*** Treemacs Evil
#+begin_src emacs-lisp
(use-package treemacs-evil
  :after evil)
#+end_src

*** Treemacs Projectile
#+begin_src emacs-lisp
(use-package treemacs-projectile
  :after projectile)
#+end_src

* Keyboard

#+begin_src emacs-lisp
(use-package general
    :config
	(general-evil-setup t)
	(general-create-definer mati/leader-keys
	    :keymaps '(normal insert visual emacs)
	    :prefix "SPC"
	    :global-prefix"C-SPC"))
	   
#+end_src
  

** For OSX
#+begin_src emacs-lisp
(custom-set-variables
    ;; custom-set-variables was added by Custom.
    ;; If you edit it by hand, you could mess it up, so be careful.
    ;; Your init file should contain only one such instance.
    ;; If there is more than one, they won't work right.
    '(mac-command-modifier 'control)
    '(mac-control-modifier nil)
    '(mac-option-modifier 'meta)
    '(mac-right-control-modifier 'left)
    '(mac-right-option-modifier 'alt))
(custom-set-faces
    ;; custom-set-faces was added by Custom.
    ;; If you edit it by hand, you could mess it up, so be careful.
    ;; Your init file should contain only one such instance.
    ;; If there is more than one, they won't work right.
)
#+end_src

