.emacs.d/Emacs.org
** EVIL
#+begin_src emacs-lisp
(defun mati/evil-hook ()
    (dolist (mode '(custom-mode
	    eshell-mode
	    git-rebase-mode
	    erc-mode
	    circe-server-mode
	    circe-chat-mode
	    circe-query-mode
	    sauron-mode
	    term-mode))
	(add-to-list 'evil-emacs-state-modes mode)))

(use-package undo-tree			
    :init
	(global-undo-tree-mode 1)
    :bind (:map undo-tree-map
		("C-/" . nil)
		("C-z" . 'undo-tree-undo)
		("C-S-z" . 'undo-tree-redo)))

(use-package evil
    :init
	(setq evil-want-integration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	(setq evil-respect-visual-line-mode t)
	(setq evil-undo-system 'undo-tree)
    :bind (:map evil-insert-state-map
	    ("C-g" . 'evil-normal-state)
	    ("C-h" . 'evil-delete-backward-char-and-join)
	    ("C-z" . nil)
       :map evil-motion-state-map
            ("C-z" . nil))
    :config
	(add-hook 'evil-mode-hook 'mati/evil-hook)
	(evil-mode 1)
	
	(define-key evil-normal-state-map (kbd "SPC h") (general-simulate-key "C-h"))
	(define-key evil-normal-state-map (kbd "SPC x") (general-simulate-key "C-x"))
	(define-key evil-normal-state-map (kbd "SPC c") (general-simulate-key "C-c"))
	(define-key evil-normal-state-map (kbd "SPC m") (general-simulate-key "M-x"))
	(define-key evil-normal-state-map (kbd "SPC w") (general-simulate-key "C-w"))
	
	(define-key evil-insert-state-map (kbd "C-SPC h") (general-simulate-key "C-h"))
	(define-key evil-insert-state-map (kbd "C-SPC x") (general-simulate-key "C-x"))
	(define-key evil-insert-state-map (kbd "C-SPC c") (general-simulate-key "C-c"))
	(define-key evil-insert-state-map (kbd "C-SPC m") (general-simulate-key "M-x"))
	(define-key evil-insert-state-map (kbd "C-SPC w") (general-simulate-key "C-W"))
	
	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)


	(evil-ex-define-cmd "q" 'kill-this-buffer)
	(evil-ex-define-cmd "qa" 'evil-quit)

	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
    :after evil
    :config (evil-collection-init))

(use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

#+end_src

** Hydra
#+begin_src emacs-lisp
(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("0" (text-scale-adjust 0) "normal") 
    ("f" nil "finished" :exit t))

#+end_src

** Custom
#+begin_src emacs-lisp
  (defun mati/open-config ()
      (interactive)
      (find-file (expand-file-name "~/.emacs.d/Emacs.org")))

  (mati/leader-keys
      "q" '(org-capture :which-key "capture")
      "a" '(:ingore true :which-key "agenda")
      "aa" '(org-agenda-list :which-key "agenda")
      "ad" '(org-agenda :which-key "dashboard")
      "df" '(org-roam-node-find :which-key "find node")
      "di" '(org-roam-node-insert :which-key "insert node")
      "dt" '(org-roam-dailies-goto-today :which-key "today")

      "b" '(:ignore t :which-key "buffer")
      "bi" '(ibuffer :which-key "ibuffer")
      "bk" '(kill-this-buffer :which-key "kill buffer")
      "bo" '(counsel-ibuffer :which-key "open") 

      "t" '(:ignore t :which-key "toggles")
      "tt" '(treemacs :which-key "browse dir tree")
      "ts" '(hydra-text-scale/body :which-key "scale text")
      "tr" '(org-roam-buffer-toggle :which-key "roam buffer")

      "p" '(:ignore t :which-key "project") 
      "pf"  'projectile-find-file
      "po"  '(projectile-switch-project :which-key "open")
      "pF"  'consult-ripgrep
      "pc"  'projectile-compile-project
      "pd"  'projectile-dired 
      "pn"  '(projectile-add-known-project :which-key "new project") 

      "g"   '(:ignore t :which-key "git")
      "gs"  'magit-status
      "gd"  'magit-diff-unstaged
      "gc"  'magit-branch-or-checkout
      "gl"   '(:ignore t :which-key "log")
      "glc" 'magit-log-current
      "glf" 'magit-log-buffer-file
      "gb"  'magit-branch
      "gP"  'magit-push-current
      "gp"  'magit-pull-branch
      "gf"  'magit-fetch
      "gF"  'magit-fetch-all
      "gr"  'magit-rebase

      "u" '(:ignore true :which-key "utilities")

      "f" '(:ignore true :which-key "files")
      "fo" '(find-file :which-key "open")
      "." '(find-file :which-key "open file")
      "fd" '(dired :which-key "directory")
      "fc" '(mati/open-config :which-key "config")

      ":" '(eval-expression :which-key "eval")
      "s" '(shell :which-key "shell")
      "/" 'swiper
      "h" '(:ignore true :which-key "help")
      "d" '(:ignore true :which-key "docs")
      "c" '(:ignore true :which-key "C-c")
      "w" '(:ignore true :which-key "window")
      "m" '(:ignore true :which-key "M-x")
      "x" '(:ignore true :which-key "C-x"))

  ;; (general-define-key
  ;;  :keymaps '(org-mode-map)
  ;;  :prefix "SPC"
  ;;  :global-prefix "C-SPC"
  ;;  "dd" '(org-roam-dailies-map))

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (global-unset-key (kbd "C-x C-b"))
  (global-unset-key (kbd "C-x C-@"))
  (global-unset-key (kbd "C-x C-<SPC>"))
  (global-unset-key (kbd "C-/"))

#+end_src

* Development
** Projectile
#+begin_src emacs-lisp
(use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :demand t
    :bind ("C-M-p" . projectile-find-file)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects/")
    (setq projectile-project-search-path '("~/Projects/")))
    (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
    :after projectile
    :config
    (counsel-projectile-mode))

#+end_src

** Magit
#+begin_src emacs-lisp
(use-package magit)

#+end_src

** IDE Features with lsp-mode

*** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
(defun mati/lsp-mode-setup ()
(define-key evil-normal-state-map (kbd "SPC l") (general-simulate-key "C-l"))
(define-key evil-insert-state-map (kbd "C-SPC l") (general-simulate-key "C-l"))
(setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
(lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
:commands (lsp lsp-deferred)
:hook ((lsp-mode . mati/lsp-mode-setup)
    (c-mode . lsp-deferred)
    (c++-mode . lsp-deferred)
    (go-mode . lsp-deferred)
    (prog-mode . lsp-mode))
:init
(setq lsp-keymap-prefix "C-l")  ;; Or 'C-l', 's-l'
:config
(lsp-enable-which-key-integration t)
(setq lsp-clients-clangd-args '("--header-insertion=never"
				"--completion-style=bundled"
				"--background-index")))

#+end_src

*** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp
(use-package lsp-ui
:hook (lsp-mode . lsp-ui-mode)
:custom
(lsp-ui-doc-position 'bottom))

#+end_src

*** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp
(use-package lsp-treemacs
:after lsp
:commands (lsp-treemacs-errors-list
	lsp-treemacs-symbols)
:config
    (lsp-treemacs-sync-mode t))

#+end_src

*** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp
(use-package lsp-ivy)

#+end_src

** Folding
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook #'hs-minor-mode)
#+end_src
