.emacs.d/init.el

(defun mati/evil-hook ()
    (dolist (mode '(custom-mode
	    eshell-mode
	    git-rebase-mode
	    erc-mode
	    circe-server-mode
	    circe-chat-mode
	    circe-query-mode
	    sauron-mode
	    term-mode))
	(add-to-list 'evil-emacs-state-modes mode)))

(use-package undo-tree			
    :init
	(global-undo-tree-mode 1)
    :bind (:map undo-tree-map
		("C-/" . nil)
		("C-z" . 'undo-tree-undo)
		("C-S-z" . 'undo-tree-redo)))

(use-package evil
    :init
	(setq evil-want-integration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	(setq evil-respect-visual-line-mode t)
	(setq evil-undo-system 'undo-tree)
    :bind (:map evil-insert-state-map
	    ("C-g" . 'evil-normal-state)
	    ("C-h" . 'evil-delete-backward-char-and-join)
	    ("C-z" . nil)
       :map evil-motion-state-map
            ("C-z" . nil))
    :config
	(add-hook 'evil-mode-hook 'mati/evil-hook)
	(evil-mode 1)
	
	(define-key evil-normal-state-map (kbd "SPC h") (general-simulate-key "C-h"))
	(define-key evil-normal-state-map (kbd "SPC x") (general-simulate-key "C-x"))
	(define-key evil-normal-state-map (kbd "SPC c") (general-simulate-key "C-c"))
	(define-key evil-normal-state-map (kbd "SPC m") (general-simulate-key "M-x"))
	
	(define-key evil-insert-state-map (kbd "C-SPC h") (general-simulate-key "C-h"))
	(define-key evil-insert-state-map (kbd "C-SPC x") (general-simulate-key "C-x"))
	(define-key evil-insert-state-map (kbd "C-SPC c") (general-simulate-key "C-c"))
	(define-key evil-insert-state-map (kbd "C-SPC m") (general-simulate-key "M-x"))
	
	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal))


(use-package evil-collection
    :after evil
    :config (evil-collection-init))

(use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("0" (text-scale-adjust 0) "normal") 
    ("f" nil "finished" :exit t))

(mati/leader-keys
    "q" '(org-capture :which-key "capture")
    "a" '(:ingore true :which-key "agenda")
    "aa" '(org-agenda-list :which-key "agenda")
    "ad" '(org-agenda :which-key "dashboard")

    "b" '(:ignore t :which-key "buffer")
    "bi" '(ibuffer :which-key "ibuffer")
    "bk" '(kill-this-buffer :which-key "kill buffer")
    "bo" '(counsel-ibuffer :which-key "open") 

    "t" '(:ignore t :which-key "toggles")
    "tt" '(treemacs :which-key "browse dir tree")
    "ts" '(hydra-text-scale/body :which-key "scale text")

    "p" '(:ignore t :which-key "project") 
    "pf"  'projectile-find-file
    "po"  '(projectile-switch-project :which-key "open")
    "pF"  'consult-ripgrep
    "pc"  'projectile-compile-project
    "pd"  'projectile-dired 

    "g"   '(:ignore t :which-key "git")
    "gs"  'magit-status
    "gd"  'magit-diff-unstaged
    "gc"  'magit-branch-or-checkout
    "gl"   '(:ignore t :which-key "log")
    "glc" 'magit-log-current
    "glf" 'magit-log-buffer-file
    "gb"  'magit-branch
    "gP"  'magit-push-current
    "gp"  'magit-pull-branch
    "gf"  'magit-fetch
    "gF"  'magit-fetch-all
    "gr"  'magit-rebase

    "u" '(ue-command-map :which-key "unreal")
    
    "f" '(:ignore true :which-key "files")
    "fo" '(find-file :which-key "open")

    ":" '(eval-expression :which-key "eval")
    "s" '(shell :which-key "shell")
    "h" '(:ignore true :which-key "help")
    "c" '(:ignore true :which-key "C-c")
    "m" '(:ignore true :which-key "M-x")
    "x" '(:ignore true :which-key "C-x"))


(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-unset-key (kbd "C-x C-b"))
(global-unset-key (kbd "C-x C-@"))
(global-unset-key (kbd "C-x C-<SPC>"))
(global-unset-key (kbd "C-/"))

(use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :demand t
    :bind ("C-M-p" . projectile-find-file)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects/")
    (setq projectile-project-search-path '("~/Projects/")))
    (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
    :after projectile
    :config
    (counsel-projectile-mode))

(use-package magit)

(defun mati/lsp-mode-setup ()
(setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
(lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
:commands (lsp lsp-deferred)
:hook ((lsp-mode . mati/lsp-mode-setup)
	(prog-mode . lsp-mode))
:init
(setq lsp-keymap-prefix "C-l")  ;; Or 'C-l', 's-l'
:config
(lsp-enable-which-key-integration t))

(use-package lsp-ui
:hook (lsp-mode . lsp-ui-mode)
:custom
(lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
:after lsp)

(use-package lsp-ivy)

(use-package company
:after lsp-mode
