.emacs.d/Emacs.org
** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp
(use-package company
:after lsp-mode
:hook (lsp-mode . company-mode)
:bind (:map company-active-map ("C-TAB" . company-complete-selection))
    (:map lsp-mode-map ("C-TAB" . company-indent-or-complete-common))
:custom
(company-minimum-prefix-length 1)
(company-idle-delay 0.0))

(use-package company-box
:hook (company-mode . company-box-mode))

#+end_src

** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :init   (global-flycheck-mode t))

#+end_src

** Tabnine
+begin_src emacs-lisp
(use-package company-tabnine
:after company
:config
    (add-to-list 'company-backends #'company-tabnine)

    ;; Trigger completion immediately.
    (setq company-idle-delay 0.4)

    ;; Number the candidates (use M-1, M-2 etc to select completions).
    (setq company-show-numbers t))

+end_src

** Yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :config
  (setq yas-indent-line 'fixed)
  (yas-reload-all)
  :hook   (prog-mode . yas-minor-mode))

#+end_src

** Commenting

Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
:bind ("C-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Shell Config
#+begin_src emacs-lisp
(use-package xterm-color
  :straight (xterm-coloer :type git :host github :repo "atomontage/xterm-color"))


(setq comint-output-filter-functions
      (remove 'ansi-color-process-output comint-output-filter-functions))

(add-hook 'shell-mode-hook
          (lambda ()
            ;; Disable font-locking in this buffer to improve performance
            (font-lock-mode -1)
            ;; Prevent font-locking from being re-enabled in this buffer
            (make-local-variable 'font-lock-function)
            (setq font-lock-function (lambda (_) nil))
            (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

#+end_src

** Debug
#+begin_src emacs-lisp
(use-package dap-mode
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  ;; :config
  ;; (dap-ui-mode 1)

  :config
  ;; install native debug. The first time run dap-gdb-lldb-setup
  ;; Then do dap-debug or dap-debug-edit-template and selet GBD or LLDB configuration.
  (require 'dap-gdb-lldb)

  ;; install go debug. The first time run dap-go-setup
  (require 'dap-go)

  ;; install python debug. Run pip install "ptvsd>=4.2"
  (require 'dap-python)

  ;; powershell debug.
  (require 'dap-pwsh)
  
  ;; Bind `C-c l d` to `dap-hydra` for easy access
  (general-define-key
    :keymaps 'lsp-mode-map
    :prefix lsp-keymap-prefix
    "d" '(dap-hydra t :wk "debugger")))


#+end_src

** Languages
*** C++
#+begin_src emacs-lisp
(use-package modern-cpp-font-lock
:config (modern-c++-font-lock-global-mode t))

(use-package clang-format)

(use-package highlight-doxygen)

(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
(add-hook
 'c++-mode-hook
 (lambda ()
   (setq c-default-style "bsd"
	 c-basic-offset  4
	 tab-width       4)
   (c-set-offset 'innamespace 0)
   (highlight-doxygen-mode t)
   ;; https://www.emacswiki.org/emacs/ElectricPair
   (electric-pair-mode t)
   ;; https://wikemacs.org/wiki/Subword-mode
   (subword-mode t)
   (display-line-numbers-mode t)
   ;; Set the right margin according to Epic Games coding standard
   (setq-local fill-column 120)

   (evil-local-set-key 'normal (kbd "SPC u u") 'ue-command-map)
   (evil-local-set-key 'normal (kbd "SPC u f") 'clang-format-buffer)
   (evil-local-set-key 'normal (kbd "SPC u y") 'company-yasnippet)))

#+end_src

**** Unreal Engine
#+begin_src emacs-lisp
  ;; (use-package ue
    ;; :init   (ue-global-mode t))
(use-package ue
  :straight (ue :type git :host gitlab :repo "unrealemacs/ue.el")
  :init (ue-global-mode))

#+end_src

** Golang
#+begin_src emacs-lisp
;;Goimports
(defun go-mode-setup ()
  ;(go-eldoc-setup)
  (add-hook 'before-save-hook 'gofmt-before-save) 
  (setq gofmt-command "goimports"))

(use-package go-mode
  :hook (go-mode . go-mode-setup))

#+end_src

* ORG-Mode
#+begin_src emacs-lisp
(use-package org
:bind (:map org-mode-map
	    ("C-c c" . org-ctrl-c-ctrl-c)
	    ("C-c t" . org-todo)
	    ("C-c d" . org-deadline)
	    ("C-c s" . org-schedule)
	    ("C-c w" . org-refile)
	    ("C-c a" . org-attach))
:config
    (setq org-agenda-files '("~/org/todo.org"
			    "~/org/contacts.org"))
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-capture-templates
      `(("t" "Task" entry (file+olp "~/org/todo.org" "Inbox")
		"* TODO %?\n  SCHEDULED: %U\n  %a\n  %i" :empty-lines 1)

	("j" "Journal" entry
		(file+olp+datetree "~/org/journal.org")
		"\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
		;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
		:clock-in :clock-resume
		:empty-lines 1)
	("n" "notes" entry
		(file+olp+datetree "~/org/notes.org")
		"* %<%I:%M %p> - %a :notes:\n\n%?\n\n"
		:clock-in :clock-resume
		:empty-lines 1)
	("m" "Metrics Capture")
	("mw" "Weight" table-line
	    (file+headline "~/org/gym.org" "Weight")
	    "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

    (setq org-refile-targets
	'(("notes.org" :maxlevel . 1)
	("todo.org" :maxlevel . 1)))


    ;; Configure autosaving
    (advice-add 'org-agenda-todo :after
		(lambda (&rest _)
		    (org-save-all-org-buffers)))

    (setq org-support-shift-select t)
    (setq org-todo-keywords
	    '((sequence "TODO(t)" "SOMEDAY(s)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
	'(("W" "Work Tasks" tags "+Au"))))


(use-package org-bullets
:hook (org-mode . org-bullets-mode)
:custom (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** org-babel  
#+begin_src emacs-lisp
(org-babel-do-load-languages
'org-babel-load-languages
'((emacs-lisp . t)
(python . t)
(C . t)
(org . t)))
(setq org-confirm-babel-evaluate nil)  
(setq org-src-preserve-indentation t)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cpp" . "src c++"))

#+end_src

*** Auto-tangle Config Files
#+begin_src emacs-lisp
;; Automatically tangle our Emacs.org config file when we save it
(defun mati/org-babel-tangle-config ()
(when (string-equal (buffer-file-name)
		(expand-file-name "~/.emacs.d/Emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mati/org-babel-tangle-config)))

#+end_src

** Roam
#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/org")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("b" "book notes" plain
     "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
     :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
     :unnarrowed t)
     ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
	:unnarrowed t)))
  (org-roam-dailies-capture-templates
    '(("d" "default" entry "* %<%I:%M %p>: %?"
       :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  :bind (:map org-mode-map
        ("C-TAB"  . completion-at-point)
	:map org-roam-dailies-map
	("Y" . org-roam-dailies-capture-yesterday)
        ("T" . org-roam-dailies-capture-tomorrow))
  :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    (defun mati/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ;; Set this to nil to delete the original!
	    (org-roam-dailies-capture-templates
	    '(("t" "tasks" entry "%?"
		:if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
	    (org-after-refile-insert-hook #'save-buffer)
	    today-file
	    pos)
	(save-window-excursion
	(org-roam-dailies--capture (current-time) t)
	(setq today-file (buffer-file-name))
	(setq pos (point)))

	;; Only refile if the target file is different than the current file
	(unless (equal (file-truename today-file)
		    (file-truename (buffer-file-name)))
	(org-refile nil nil (list "Tasks" today-file nil pos)))))

    (add-to-list 'org-after-todo-state-change-hook
		(lambda ()
		(when (equal org-state "DONE")
		    (mati/org-roam-copy-todo-to-today))))
    (org-roam-db-autosync-mode)
    (org-roam-setup))

#+end_src

* Chat
** IRC
#+begin_src emacs-lisp
(setq erc-server "irc.libera.chat"
      erc-nick "enki97"    ; Change this!
      erc-user-full-name "Mati A"  ; And this!
      erc-track-shorten-start 8
      erc-autojoin-channels-alist '(("irc.libera.chat" "#systemcrafters" "#emacs"))
	erc-kill-buffer-on-part t
	erc-auto-query 'bury)

#+end_src

** Telegram
#+begin_src emacs-lisp
(use-package telega)

#+end_src
** Discord Rich Presence
#+begin_src emacs-lisp
(use-package elcord
  :config (elcord-mode))
#+end_src

*** TODO Install clients for Telegram, Matrix and discord


* Applications
** Some App

This is an example of configuring another non-Emacs application using org-mode.  Not only do we write out the configuration at =.config/some-app/config=, we also compute the value that gets stored in this configuration from the Emacs Lisp block above it.

#+NAME: the-value
#+begin_src emacs-lisp :tangle no
(+ 400 20)
#+end_src


+begin_src org :tangle .config/some-app/config :noweb yes :makedirp yes 
value=<<the-value()>>
+end_src

