.emacs.d/init.el
:hook (lsp-mode . company-mode)
:bind (:map company-active-map ("C-SPC" . company-complete-selection))
    (:map lsp-mode-map ("C-SPC" . company-indent-or-complete-common))
:custom
(company-minimum-prefix-length 1)
(company-idle-delay 0.0))

(use-package company-box
:hook (company-mode . company-box-mode))

(use-package flycheck
  :init   (global-flycheck-mode t))

(use-package company-tabnine
:after company
:config
    (add-to-list 'company-backends #'company-tabnine)

    ;; Trigger completion immediately.
    (setq company-idle-delay 0.4)

    ;; Number the candidates (use M-1, M-2 etc to select completions).
    (setq company-show-numbers t))

(use-package evil-nerd-commenter
:bind ("C-/" . evilnc-comment-or-uncomment-lines))

(use-package xterm-color
  :straight (xterm-coloer :type git :host github :repo "atomontage/xterm-color"))


(setq comint-output-filter-functions
      (remove 'ansi-color-process-output comint-output-filter-functions))

(add-hook 'shell-mode-hook
          (lambda ()
            ;; Disable font-locking in this buffer to improve performance
            (font-lock-mode -1)
            ;; Prevent font-locking from being re-enabled in this buffer
            (make-local-variable 'font-lock-function)
            (setq font-lock-function (lambda (_) nil))
            (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

(use-package dap-mode
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  ;; :config
  ;; (dap-ui-mode 1)

  :config
  ;; install native debug. The first time run dap-gdb-lldb-setup
  ;; Then do dap-debug or dap-debug-edit-template and selet GBD or LLDB configuration.
  (require 'dap-gdb-lldb)

  ;; install go debug. The first time run dap-go-setup
  (require 'dap-go)

  ;; install python debug. Run pip install "ptvsd>=4.2"
  (require 'dap-python)

  ;; powershell debug.
  (require 'dap-pwsh)
  
  ;; Bind `C-c l d` to `dap-hydra` for easy access
  (general-define-key
    :keymaps 'lsp-mode-map
    :prefix lsp-keymap-prefix
    "d" '(dap-hydra t :wk "debugger")))

(use-package modern-cpp-font-lock
:config (modern-c++-font-lock-global-mode t))

(use-package clang-format)

  (use-package ue
  :straight (ue :type git :host gitlab :repo "unrealemacs/ue.el")
  :init (ue-global-mode))

(use-package org
:config
    (setq org-agenda-files '("~/org/todo.org"
			    "~/org/contacts.org"))
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-capture-templates
	`(("t" "Tasks / Projects")
	("tt" "Task" entry (file+olp "~/org/todo.org" "Inbox")
		"* TODO %?\n  SCHEDULED: %U\n  %a\n  %i" :empty-lines 1)

	("j" "Journal Entries")
	("jj" "Journal" entry
		(file+olp+datetree "~/org/journal.org")
		"\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
		;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
		:clock-in :clock-resume
		:empty-lines 1)
	("jm" "notes" entry
		(file+olp+datetree "~/org/notes.org")
		"* %<%I:%M %p> - %a :notes:\n\n%?\n\n"
		:clock-in :clock-resume
		:empty-lines 1)

	("m" "Metrics Capture")
	("mw" "Weight" table-line
	    (file+headline "~/org/gym.org" "Weight")
	    "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

    (setq org-refile-targets
	'(("notes.org" :maxlevel . 1)
	("todo.org" :maxlevel . 1)))


    ;; Configure autosaving
    (advice-add 'org-agenda-todo :after
		(lambda (&rest _)
		    (org-save-all-org-buffers)))



    (setq org-todo-keywords
	    '((sequence "TODO(t)" "SOMEDAY(s)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
	'(("W" "Work Tasks" tags "+Au"))))


(use-package org-bullets
:hook (org-mode . org-bullets-mode)
:custom (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(org-babel-do-load-languages
'org-babel-load-languages
'((emacs-lisp . t)
(python . t)
(C . t)
(org . t)))
(setq org-confirm-babel-evaluate nil)  
(setq org-src-preserve-indentation t)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cpp" . "src c++"))

;; Automatically tangle our Emacs.org config file when we save it
(defun mati/org-babel-tangle-config ()
(when (string-equal (buffer-file-name)
		(expand-file-name "~/.emacs.d/Emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mati/org-babel-tangle-config)))
